# Project 3

1.  Create a pandas DataFrame that displays Customers’ Last
Name and First Name, and each customer’s purchased Track names and
Album Titles. The information should be sorted by Customer LastName
then Customer FirstName.

Connect to MySQL Database

In [3]:
import sqlalchemy as sqla
import pandas as pd

Connect to sqlite database

In [4]:
db = sqla.create_engine('sqlite:///Chinook_Sqlite.sqlite')

Get table counts

In [5]:
custCntSql = '''SELECT count(*) FROM customer'''
pd.read_sql(custCntSql, db).head()

   count(*)
0        59

In [6]:
invCntSql = '''SELECT count(*) FROM invoice'''
pd.read_sql(invCntSql, db).head()

   count(*)
0       412

In [7]:
trckCntSql = '''SELECT count(*) FROM track'''
pd.read_sql(trckCntSql, db).head()

   count(*)
0      3503

In [8]:
albCntSql = '''SELECT count(*) FROM album'''
pd.read_sql(albCntSql, db).head()

   count(*)
0       347

In [20]:
sql1 = '''SELECT cus.lastName, cus.firstName, trk.Name as 'Track Name', alb.Title
          FROM customer cus
          LEFT JOIN invoice inv ON cus.CustomerId = inv.CustomerId
          LEFT JOIN InvoiceLine invl ON inv.InvoiceId = invl.InvoiceId
          LEFT JOIN track trk ON invl.TrackId = trk.TrackId
          LEFT JOIN album alb ON trk.AlbumId = alb.AlbumId
          ORDER BY cus.LastName, cus.FirstName ASC'''

In [21]:
pd.read_sql(sql1, db).head()

,LastName,FirstName,Track Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas

In [28]:
# Validation since data does not match assignment expectation.

sql2 = '''SELECT trk.Name, alb.Title
          FROM album alb
          JOIN track trk ON alb.AlbumId = trk.AlbumId
          WHERE trk.Name = \'Fool In The Rain\''''
pd.read_sql(sql2, db).head()

               Name                    Title
0  Fool In The Rain  In Through The Out Door

In [29]:
sql2 = '''SELECT trk.Name, alb.Title
          FROM album alb
          JOIN track trk ON alb.AlbumId = trk.AlbumId
          WHERE trk.Name = \'In The Evening\''''
pd.read_sql(sql2, db).head()

             Name                    Title
0  In The Evening  In Through The Out Door

In [32]:
sql2 = '''SELECT trk.Name, alb.Title
          FROM album alb
          JOIN track trk ON alb.AlbumId = trk.AlbumId
          WHERE trk.Name LIKE \'Saudade Dos Aviões%\''''
pd.read_sql(sql2, db).head()

                                                Name  Title
0  Saudade Dos Aviões Da Panair (Conversando No Bar)  Minas